-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1:3306
-- 生成日期： 2022-03-24 08:58:54
-- 服务器版本： 5.6.34
-- PHP 版本： 7.1.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `movie`
--

-- --------------------------------------------------------

--
-- 表的结构 `account`
--

CREATE TABLE `account` (
  `id` int(15) NOT NULL,
  `userName` varchar(20) NOT NULL,
  `password` varchar(16) NOT NULL,
  `sex` char(2) DEFAULT NULL,
  `email` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `account`
--

INSERT INTO `account` (`id`, `userName`, `password`, `sex`, `email`) VALUES
(1, 'admin', '951753', '男', 'hhghfhh'),
(2, 'xls', '123456', '男', '152012586@qq.com'),
(3, 'adhad', '464', '男', 'dlajdlajldjaldjakljd'),
(5, '阿达的', '464', '男', 'dlajdlajldjaldjakljd'),
(12, 'cyy', '775895', '女', '4564231@qq.com');

-- --------------------------------------------------------

--
-- 表的结构 `cinema`
--

CREATE TABLE `cinema` (
  `cid` int(11) NOT NULL,
  `cName` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `cPhone` varchar(20) NOT NULL,
  `price` int(11) NOT NULL,
  `cImage` text NOT NULL,
  `location` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `cinema`
--

INSERT INTO `cinema` (`cid`, `cName`, `address`, `cPhone`, `price`, `cImage`, `location`) VALUES
(4541, 'SFC上影影城（广州店）', '海珠区江燕路108号燕汇广场4楼', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB15djMewZC2uNjSZFnXXaxZpXa_.jpg', '113.2781502794,23.0824370265'),
(4670, '中影佰纳飞影电影城（天河店）', '天河区东莞庄路富力院士庭广场2楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB10B9AjmMmBKNjSZTEXXasKpXa_.jpg', '113.33626985549927,23.151586623441588'),
(4688, '华影万晟国际影城', '荔湾区逢源路153号（近西关永庆坊旅游区）', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB16_IkjljTBKNjSZFNXXasFXXa_.jpg', '113.23876619338989,23.120750581903586'),
(4819, '广州华影梅花园影城', '白云区广州大道北28号梅花园商业广场5楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB11THRi_qWBKNjSZFxXXcpLpXa_.jpg', '113.320831,23.178219'),
(5018, '中华广场电影城', '越秀区中山三路33号中华广场8楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//101000000150620500/1629691088805DSC06794.jpg', '113.28234940767288,23.12568033565123'),
(5864, '广东科学中心科技影院', '番禺区广州大学城西六路168号', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.362688,23.039233'),
(5887, '橙天嘉禾影城（广州五号停机坪店）', '白云区白云新城机场路云霄路五号停机坪购物广场3楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//110460/1555045058942IMG_1587.JPG', '113.2670259475708,23.18242050156944'),
(6244, '金逸影城(维家思店)', '天河区黄埔大道西188号维家思广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1G6_WjiMnBKNjSZFoXXbOSFXa_.jpg', '113.3275821464,23.1252227108'),
(8054, '金逸影城(太阳城IMAX店)', '白云区广州大道北1811号嘉裕太阳城广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1CnnTi5MnBKNjSZFCXXX0KFXa_.jpg', '113.3275765746,23.187493848'),
(8062, '金逸影城(和业店)', '荔湾区康王中路486号和业广场4楼(龙津东路口)', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1zwA8y41YBuNjy1zcXXbNcXXa_.jpg', '113.2472589558,23.1215095346'),
(8066, '金逸影城(黄埔惠润店)', '黄埔区黄埔东路298号惠润广场四层', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1TNuEjiAnBKNjSZFvXXaTKXXa_.jpg', '113.4564180956,23.1010160964'),
(9564, '左岸国际影城(罗冲围店)', '白云区松南路汇锦新天地广场D栋1-3楼（富力半岛花园，罗冲围客运站旁）', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1VHaOb.z.BuNjt_j7XXX0nFXa_.jpg', '113.2225511534,23.1494644301'),
(9755, '广州UA IMAX花城汇电影城', '天河区广州市天河区黄埔大道西74号花城汇负一层1130-1132号铺', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1zYwkjljTBKNjSZFwXXcG4XXa_.jpg', '113.3247421464,23.1264217108'),
(9828, '广州中影国际影城（太阳新天地店）', '天河区马场路36号8楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB188CEjoOWBKNjSZKzXXXfWFXa_.jpg', '113.3437267088,23.123426594'),
(13772, '爱禧影城鹅掌坦店（原保利影城）', '白云区西槎路99号骐利广场C座5楼地铁8号线鹅掌坦A出口20米', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1oTfLiY3nBKNjSZFMXXaUSFXa_.jpg', '113.2349812707,23.1557316202'),
(14844, '万达影城（白云万达广场IMAX店）', '白云区云城东路503号白云万达广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1ZZ9Pb8cXBuNjt_XoXXXIwFXa_.jpg', '113.266631,23.172029'),
(15047, '飞扬影城IMAX激光乐峰店', '海珠区工业大道北106-108号楼乐峰广场2楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1PYkxjiMnBKNjSZFzXXc_qVXa_.jpg', '113.259491,23.08902'),
(15879, '金逸空中影城', '海珠区阅江西路222号广州塔B功能区（17-22楼）', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1palVjf6TBKNjSZJiXXbKVFXa_.jpg', '113.3254356464,23.1064265692'),
(15880, '金逸影城（光美沙湾IMAX店）', '番禺区沙湾镇西环路1502号荔园新天地3楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1TnOqjcj_B1NjSZFHXXaDWpXa_.jpg', '113.346033,22.919227'),
(18982, '横店电影城（庆丰店）', '白云区庆丰广场路财智广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1cED8jXkoBKNjSZFkXXb4tFXa_.jpg', '113.2263714076,23.2120599254'),
(19552, '万达影城（番禺万达广场IMAX店）', '番禺区南村镇汉溪大道东381号番禺万达广场4层', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1g26Fi8jTBKNjSZFwXXcG4XXa_.jpg', '113.349098,23.00701'),
(19716, '大地影院（广州华通店）', '白云区人和镇鹤龙六路187号华通广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1Euz0jcj_B1NjSZFHXXaDWpXa_.jpg', '113.295860622,23.3343311802'),
(20780, '广州中影凤凰影城龙归店', '白云区太和镇龙归龙岗路1号金铂广场4楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1vwoljbZnBKNjSZFhXXc.oXXa_.jpg', '113.2949807269,23.2674814961'),
(22094, '金逸影城（光美大石IMAX店）', '番禺区大石街建华汇商业中心东街17号楼F座3楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1ontHjkZmBKNjSZPiXXXFNVXa_.jpg', '113.3158040121,23.0230556414'),
(26244, 'IDC国际影城（白云尚城杜比全景声店）', '白云区尚景街1号白云尚城文化活动中心', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1EvoKjnmWBKNjSZFBXXXxUFXa_.jpg', '113.284833,23.215424'),
(27434, '哈艺时尚影城（白云YH城店）', '白云区鹤泰路鹤龙街YH城A区3楼（鹤边、黄边）', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1tucrjkUmBKNjSZFOXXab2XXa_.jpg', '113.269549,23.214405'),
(28783, '大地影院（广州白云新市天地店）', '白云区云城街新市南街45号联富文化商业广场F座3楼全层', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB13zqEXhtnkeRjSZSgXXXAuXXa_.jpg', '113.265401348,23.1917061782'),
(29820, '【市桥】中影JAJ24小时影院·影吧（易发街店）', '番禺区市桥街繁华路3号三楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1wZykjdknBKNjSZKPXXX6OFXa_.jpg', '113.364122,22.941937'),
(30897, '金逸珠江国际影城广州大学城店', '番禺区小谷街道贝岗村中二横路1号GOGO新天地商业广场二期二楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1gt1bjaAoBKNjSZSyXXaHAVXa_.jpg', '113.39202,23.063397'),
(31012, '广州中影凤凰国际影城同和店', '白云区广州大道北同和街1号金铂广场4楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1Gev0jcj_B1NjSZFHXXaDWpXa_.jpg', '113.325382,23.197076'),
(31278, '金逸影城(海珠城IMAX店)', '海珠区江南大道中180号富力海珠商业广场B区七层703号', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//98024/1595392911991_ZJN4104-Pano_%E5%89%AF%E6%9C%AC_%E5%89%AF%E6%9C%AC.jpg', '113.273989,23.09548'),
(31323, '广州乐天影城', '白云区钟落潭钟升东路47-49号303乐天影城', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1XaJgjljTBKNjSZFNXXasFXXa_.jpg', '113.404193,23.379332'),
(31405, '哈艺时尚影城（白云东平店）', '白云区永平街东平中路时代都荟3楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//101000000190611980/1557928276128logo.jpg', '113.309329,23.247998'),
(31491, '星河影城番禺南村店', '番禺区番禺南村兴业大道之一人人佳购物广场2楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1VuQ7i5AnBKNjSZFvXXaTKXXa_.jpg', '113.389007,23.004875'),
(31665, '五一影城（四季天地店）', '海珠区赤岗北路118号四季天地3楼', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB1..ajjj7nBKNjSZLeXXbxCFXa_.jpg', '113.327591,23.100303'),
(33201, 'FUN范影城（洛溪·激光巨幕）', '番禺区洛溪新城洛浦街上漖村—奥林匹克大厦4楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//67032/1630217274367e7790a689e8d07f4a417dc6edd169cc.png', '113.3071,23.041085'),
(34370, '从化影天下国际影城', '从化区从城大道欣荣宏国际商贸城三楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1EdknjfImBKNjSZFlXXc43FXa_.jpg', '113.591522,23.531522'),
(34594, 'CGV影城(永旺店)', '番禺区大龙街亚运大道1号永旺梦乐城4F（10:00前、22:00后，从胜龙酒店对面（HM外墙旁）的直梯到达影城）', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1QrkDy1uSBuNjSsplXXbe8pXa_.jpg', '113.388071,22.9371'),
(36031, '龙影国际影城（平沙店）', '白云区均禾平沙商贸大厦万仓隆3楼龙影国际影城', '', 0, 'https://gw.alicdn.com/tfscom/i2/TB11S8ejlnTBKNjSZPfXXbf1XXa_.jpg', '113.256671,23.246452'),
(36293, '【大石】中影JAJ24小时咖啡.影院(科宝商城店)', '番禺区大石街朝阳东路186号科宝商城A栋2楼', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1g2.fjlsmBKNjSZFFXXcT9VXa_.jpg', '113.327241,23.025961'),
(36399, '百德新光影城', '从化区太平镇经济开发区高技术产业园福从路2号301', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1ZSwvy25TBuNjSspcXXbnGFXa_.jpg', '113.491389,23.448008'),
(36442, '万达影城（广州佳永盈熙广场店）', '海珠区江南大道南（689~709号）与新窖西路交接处盈熙广场二楼', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1fQRHjkZmBKNjSZPiXXXFNVXa_.jpg', '113.287745,23.073515'),
(36457, '烽禾影城（南村剑桥郡店）', '番禺区南村镇雅居乐剑桥郡国际文化中心4楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1wvubjaAoBKNjSZSyXXaHAVXa_.jpg', '113.383869,23.022859'),
(37120, '尚上国际影城', '番禺区石楼尚上名筑营销中心3楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1wABHjkZmBKNjSZPiXXXFNVXa_.jpg', '113.488874,22.953888'),
(37914, '粤骏电影城广州店', '白云区棠景街沙涌北大街18号新乐嘉商业广场A1区二楼02铺', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1Y7nmi7omBKNjSZFqXXXtqVXa_.jpg', '113.255136,23.167863'),
(38462, '万达影城（万胜围IMAX店）', '海珠区新港东路1236号万胜广场五层', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1wP7cjljTBKNjSZFDXXbVgVXa_.jpg', '113.383171,23.097042'),
(38725, '期遇·UUE影城（易发街金口岸店）', '番禺区市桥繁华路57号金口岸大厦5-6层（友谊商店对面）', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB19qvEiYZnBKNjSZFhXXc.oXXa_.jpg', '113.362851,22.941603'),
(39004, '广州百老汇影城（LUXE凯德店）', '白云区云城西路890号凯德广场云尚05层01号', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1yp52jiMnBKNjSZFzXXc_qVXa_.jpg', '113.269661,23.181744'),
(39096, '江高巨幕国际影城', '白云区江高镇旧广花路8号亿达广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1RDySbYAaBuNjt_igXXb5ApXa_.jpg', '113.234768,23.274382'),
(39192, '中影南方韦邦国际影城', '番禺区钟村街105国道钟村新城区路段西侧雄峰商城商场2之三层B1西南角1', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB12a2fjbsrBKNjSZFpXXcXhFXa_.jpg', '113.3056,22.970245'),
(41583, '中影佰纳国际影城（番禺DMAX店）', '番禺区大石街105国道561号万盛广场北门', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB12.5aqOCYBuNkHFCcXXcHtVXa_.jpg', '113.314052,23.013823'),
(41599, '中影星海国际影城（番禺市桥店）', '番禺区光明北路281号鸿禧优活中心4楼', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1XeybjaAoBKNjSZSyXXaHAVXa_.jpg', '113.361203,22.951787'),
(41797, '诚丰影城从化店', '从化区江埔街河东南路红荔新村16幢', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB197JejljTBKNjSZFwXXcG4XXa_.jpg', '113.595855,23.543599'),
(43116, '【钟港】中影JAJ24小时咖啡·影院(钟港大厦店)', '白云区钟落潭广从五路491号钟港大厦四楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB13bckjljTBKNjSZFwXXcG4XXa_.jpg', '113.37334,23.35789'),
(44423, '丽江影城', '番禺区丽江花园渔人码头丽江影城', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1dt.rjkUmBKNjSZFOXXab2XXa_.jpg', '113.303504,23.030855'),
(45411, '中影聚丰国际影城广州店', '白云区白云湖街石夏路288号7楼', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1XPAEjljTBKNjSZFuXXb0HFXa_.jpg', '113.252988,23.217055'),
(45618, '左岸国际影城(石井店)', '白云区白云湖石沙路86号石井国际综合广场第四层D-H/1-13铺', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1HjGVjb3nBKNjSZFMXXaUSFXa_.jpg', '113.233307,23.210692'),
(48942, '大导演激光巨幕影城（广州大源店）', '白云区太和镇大源南路大源商业广场东二栋3楼', '', 0, 'https://gw.alicdn.com/tfscom/i3/TB1DY.NjbsrBKNjSZFpXXcXhFXa_.jpg', '113.34905,23.245384'),
(49056, '万达影城（亚运城广场IMAX店）', '番禺区海傍地铁站对面亚运城广场3楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1MYMrjkUmBKNjSZFOXXab2XXa_.jpg', '113.476423,22.941537'),
(49616, '唐德国际影城广州白云汇店', '白云区黄石东路88号白云汇广场7F', '', 0, 'https://gw.alicdn.com/tfscom/i1/TB1XyQcjljTBKNjSZFDXXbVgVXa_.jpg', '113.268886,23.202597'),
(53763, '中影德金影城（客村丽影店）', '海珠区新港中路356号丽影广场B区5楼', '', 0, 'https://gw.alicdn.com/tfscom/i4/TB1X828jXkoBKNjSZFkXXb4tFXa_.jpg', '113.321759,23.095921'),
(54489, '中影天川国际影城（永泰店）', '白云区丛云路945号嘉福广场三楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.302731,23.220214'),
(54860, '华夏太古影城番禺广场店', '番禺区番禺广场基盛万科中央公园（永旺梦乐城对面）', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.386554,22.932027'),
(54898, '哈艺时尚影城（祈福1店）', '番禺区钟村街福华路64号', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.333862,22.968383'),
(55300, '佳影国际影城（沙溪激光巨幕店）', '番禺区丽江明珠酒店旁8号4楼（地铁18号线沙溪站E1出口）', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//140107/1616573439442702695f45f8a2eaea909d8ac0124437.png', '113.328604,23.036807'),
(55490, '星天地国际影城', '白云区均禾街道罗岗中源广场四楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//152006/1534831796815222.png', '113.271637,23.245558'),
(55622, '中影南方V影城', '番禺区钟村街105国道钟村路段钟村市场二楼之三', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.312543,22.975245'),
(55965, '广州Wone喜航影城(海珠万科里店)', '海珠区江燕路99号201室', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//155059/15357129710301489161166.jpg', '113.279135,23.082548'),
(56072, '古时代国际影院', '番禺区沙头街小罗村小罗商业城金亿广场一楼古时代.国际影城', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.345013,22.967533'),
(56530, '广州黄埔古村影城', '海珠区黄埔村村口6号之一11-101', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.39635,23.09326'),
(57220, '广州中影国际影城（金沙洲永旺店）', '白云区沙凤一路永旺梦乐城4楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.194894,23.15033'),
(57278, '嘉莱影乐汇(白云安华汇店)', '白云区白云大道北880号安华汇A馆6楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.296534,23.216528'),
(57819, '金逸影城(百信西区IMAX店)', '白云区棠乐路百信广场西区L3-002', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.261274,23.194752'),
(57834, '中影凤凰影城（永泰店）', '白云区永泰永康路永平街宝湾广场5楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//171164/1546147803377LOGO.JPG', '113.303732,23.222289'),
(57983, '期遇·逸电影城(易发街新大新店)', '番禺区市桥易发商业街新大新百货四楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.363301,22.941727'),
(58368, 'CGV影城(万胜围4DX店)', '海珠区琶洲蟠龙新街2号保利广场（万胜围地铁口D出口）4楼CGV影城', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.383596,23.099052'),
(58708, '左岸国际影城 (黄石店)', '白云区新市黄石西路金国广场二楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//169422/1550408134077%E5%B7%A6%E5%B2%B8logo.png', '113.254175,23.204529'),
(58892, '哈艺巨幕影城（祈福2店）', '番禺区广州市番禺区钟村街祈福新邨渡假俱乐部三层', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.334719,22.969888'),
(59194, '美亚IMAX激光影城（云门店）', '白云区百顺北路1号云门newpark3楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.292354,23.235697'),
(60082, '遇见影城（人和店）', '白云区人和育英街2号人和大都汇3楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.297331,23.334476'),
(60654, '中影美妙影城(人和店)', '白云区人和大街3号首层', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.29986,23.331959'),
(61287, '任我行激光巨幕影城（嘉大广场店）', '白云区空港大道88号嘉大广场C塔美食城6层', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.290321,23.23228'),
(61385, '中影新港巨幕影城（人和店）', '白云区人和镇西城路8号人和商业中心四楼电影院', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.293118,23.342289'),
(61584, '广州传奇国际影城（广源沃尔玛店）', '白云区景泰直街33号广源文化商业中心五楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//195138/1626868292431%E4%BC%A0%E5%A5%87LOGO.jpg', '113.268915,23.161567'),
(61829, '烽禾影城祈福新店', '番禺区钟村街道钟屏岔道钟三村路段南侧钟福广场商业楼四、五层', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.322929,22.968415'),
(61841, '金逸影城（海珠新都荟店）', '海珠区东晓南路1290号401房自编4-A01号', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.29197,23.072773'),
(61869, '金逸影城（琶洲六元素店）', '海珠区新港东路1088号六元素体验天地5楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.372206,23.096478'),
(62026, '中影喜遇国际影城（赤岗路店）', '海珠区金聚街19号六福商业广场3号门2楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.327296,23.086683'),
(62103, '万达影城（番禺奥园广场PRIME店）', '番禺区桥南街福德路281号奥园广场三楼万达影城', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.358348,22.924288'),
(62167, '广州中影国际影城（中船汇店）', '海珠区革新路139号自编3号第四栋', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.254943,23.089145'),
(62866, '万达影城（海珠万达广场PRIME店）', '海珠区广州大道南978号601铺', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.312627,23.083058'),
(63391, '中影CCV影城', '白云区棠景路181号A栋四层全层', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.256458,23.173177'),
(64687, '嘉悦国际影城（富基广场店）', '海珠区同福东路663号富基广场二期五楼（市二宫地铁站B出口直达）', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//243036/1597462275907%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20200725214204_%E5%89%AF%E6%9C%AC.jpg', '113.270215,23.106865'),
(64966, '星天地国际影城·杜比巨幕（同德围）', '白云区西槎路同德围鹅掌坦百德广场四楼（地铁8号线鹅掌坦站）', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//245093/1596728597228%E6%98%9F%E5%A4%A9%E5%9C%B0LOGO.jpg', '113.234837,23.156387'),
(64988, '中影石井巨幕影城', '白云区石井街石槎路自编3号D栋3楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com/141764/rc-upload-1596255872822-17_%E7%9F%B3%E4%BA%95%E5%BD%B1%E5%9F%8ELGGO.JPG', '113.243921,23.205074'),
(65004, '中影南方星曜影城', '白云区江高镇神山社区振华南路二街47-49-51号', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.194618,23.33159'),
(68843, '尚·影城（江南大道中店）', '海珠区江南大道中218号2楼（江南西地铁B出口，海员宾馆-壹街叁号旁）', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.274892,23.094684'),
(68956, '脉铂影城(嘉禾金铂天地店)', '白云区鹤龙二路嘉禾金铂天地5楼脉铂影城', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//270008/16124367982134e1c0e4e2a1af188626688099a9c31e.png', '113.281323,23.238443'),
(69231, '期遇·悦电影城（龙归城悦和方店）', '白云区白云区龙悦新街156号龙归城悦和方购物中心四楼', '', 0, 'https://g.alicdn.com/alipay-movie-client/movie-cdn/svgfiles/taobao-movie1.svg', '113.321615,23.276925'),
(70032, '珠影飞扬影城（番禺天河城店）', '番禺区南村镇汉溪大道东366号番禺天河城A区5-6楼', '', 0, 'https://tbvideo-taobao-film.oss-cn-hangzhou.aliyuncs.com//276020/162683999318211111111.jpg', '113.348154,23.003052');

-- --------------------------------------------------------

--
-- 表的结构 `film`
--

CREATE TABLE `film` (
  `fName` varchar(255) DEFAULT NULL,
  `fid` int(11) NOT NULL,
  `score` int(11) DEFAULT NULL,
  `filmlong` tinyint(1) UNSIGNED DEFAULT NULL,
  `releaseTime` timestamp NULL DEFAULT NULL,
  `price` int(11) NOT NULL,
  `introduce` text NOT NULL,
  `fImage` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `film`
--

INSERT INTO `film` (`fName`, `fid`, `score`, `filmlong`, `releaseTime`, `price`, `introduce`, `fImage`) VALUES
('袁隆平', 119759, 0, 96, '2021-11-30 16:00:00', 1300, '《袁隆平》讲述的是袁隆平30岁至60岁阶段的故事，以杂交水稻始祖——“三系配套”的 研究为主线展开。看完影片后，来自隆平种业的谭志军、范小兵告诉记者，虽然他们熟悉袁院士，不过影片以鲜活艺术手法再现的科学家心忧天下、造福人类、自强不息、淡泊名利等情操，依然十分动情、感人。', 'https://gw.alicdn.com/i1/O1CN01xScBoe1wI7ZiMeC2y_!!6000000006284-0-alipicbeacon.jpg'),
('横空出世', 145027, 92, 115, '2021-08-31 16:00:00', 990, '1949年新中国建立以来，虽然人民当家做主人，但是新政权还随时面临被海外敌对势力所颠覆的严峻现状。惨烈的抗美援朝战争结束后，曾经立下赫赫战功的冯石将军接到中央委派的重要使命，那就是主持原子弹的研发工作。虽然对原子弹一窍不通，但是军人出身的冯石只有服从上级的命令，带着一支经过烈火淬炼的英雄部队挺近荒凉的戈壁滩。在此之后 ，以美国留学归来的陆光达等科学界的精英人才从四面八方调到了西北荒漠。白手起家，艰苦创业，在内无经验外断支援的艰苦条件下，一群怀着崇高理想的无名男儿朝着共同的目标奋勇前行。', 'https://gw.alicdn.com/i3/O1CN01zCBzcq1q2eVaxEnHr_!!6000000005438-0-alipicbeacon.jpg'),
('纽约的一个雨天', 282366, 85, 92, '2022-02-25 10:00:00', 2300, '年轻情侣盖茨比（提莫西·查拉梅 饰）与艾什莉（艾丽·范宁 饰）来到纽约曼哈顿共度周末，却阴差阳错开始了各自的行程。盖茨比在与女演员茜（赛琳娜·戈麦斯 饰）的热吻中意乱情迷，艾什莉则在多款男神的热辣眼神中沦陷。文艺少男的躁动与甜心少女的迷乱，分别在这个下雨天的城市里谱写着耐人寻味的浪漫。', 'https://gw.alicdn.com/i1/O1CN01Rrmma61JzqPQbHllf_!!6000000001100-0-alipicbeacon.jpg'),
('误杀瞒天记', 359447, 0, 163, '2022-04-14 16:00:00', 0, '一场抓不住漏洞的完美犯罪，竟然来自一个平时狂看电影只有小学学历的纯良 父亲？就此引发两个家庭 之间的对抗，谁输？谁赢？当所有人的记忆都可以被篡改，我们究竟该相信什么？\r\n一场意外的杀人案，让善良的维杰一家陷入了至暗时光。藏尸、谎言、维杰用自己的力量和沉着冷静的 头脑，一步步引导着故事的推进，谁是凶手？那天发生了什么？也许真相只有维杰才知道…', 'https://gw.alicdn.com/i3/O1CN01YdvB1c1OHU8ZnP1dX_!!6000000001680-0-alipicbeacon.jpg'),
('月球陨落', 526653, 0, 130, '2022-03-25 02:00:00', 1690, '仰望星空，⽉亮⼀向是那么的永恒。但在不久的将来，⽉球被⼀股神秘的⼒量驱使离开⽉球轨道，向我们熟知的地球⻜速⽽来，⽽在众⼈都放弃希望，地球上如世界末⽇⼀般时，⼀⽀看似乌合之众的团队决定为地球进⾏最后⼀搏，冒险为保卫⼈类最后⼀战。', 'https://gw.alicdn.com/i1/O1CN01WnPe7w1gHAwtnGfbj_!!6000000004116-0-alipicbeacon.jpg'),
('神奇动物：邓布利多之谜', 534344, 0, 0, '2022-04-07 16:00:00', 0, '阿不思·邓布利多教授（裘德·洛 饰）意识到强大的黑巫师盖勒特·格林德沃（麦斯·米科尔森 饰）正试图夺取魔法世界的控制权。邓布利多了解仅凭他一人之力，将无法阻止格林德沃，于是他委托魔法动物学家纽特·斯卡曼德（埃迪·雷德梅恩 饰）带领一支精良的团队——成员包括男巫、女巫及一位勇敢的麻瓜面包师，来共同执 行这项危险任务。一路上他们会遇到各式各样的神奇动物，既有老朋友，也有前所未见的神秘生物；同时他们也随时会与格林德沃不断壮大的追随者发生冲突。这次行动的风险是如此之高……邓布利多还能袖手旁观多久？', 'https://gw.alicdn.com/i1/O1CN01q1MjTC1hnWXL5V7Ko_!!6000000004322-0-alipicbeacon.jpg'),
('神探大战', 534395, 0, 101, '2022-04-01 16:00:00', 3800, '连环命案、私刑执法、预告杀人、以暴制暴...一群号称“神探”的团伙掀起了一场香 港有史以来最邪恶的犯罪！患有精神疾病的“癫佬神探”李俊（刘青云 饰）为查真凶独闯犯罪现场！以“神探夫妇”陈仪（蔡卓妍 饰）和方礼信（林峯 饰）为首的重案组也开启了与杀戮赛跑的缉凶之路！敌友之间，正邪边缘，死亡审判的真相究竟是什么？真正的“神探”到底是谁？', 'https://gw.alicdn.com/i2/O1CN018TksJ21xpO00rNJks_!!6000000006492-0-alipicbeacon.jpg'),
('神秘海域', 534455, 83, 116, '2022-03-14 01:00:00', 1690, '足智多谋的内森·德雷克（汤姆·赫兰德 饰）和经验丰富的寻宝者维克多·苏利文（马克·沃尔伯格 饰）组成搭档，追寻费迪南·麦哲伦500年前遗失的宝藏。一开始，这似乎只是个简单的寻宝工作，但很快演变成了一场惊险刺激、横跨全球的竞赛。他们必须赶在冷酷无情的蒙卡达（安东尼奥·班德拉斯 饰）之前寻得宝藏。蒙卡达坚信他和他的家族才是宝藏的正当继承人。若内森和苏利文能破译线索，解开这世界上最古老的谜团，他们便能找到价值50亿美元的宝藏，甚至还可能找到内森失踪已久的哥哥…但首先，他们必须学会通力合作。', 'https://gw.alicdn.com/i4/O1CN01JEUGHX29UZOChdvAA_!!6000000008071-0-alipicbeacon.jpg'),
('新蝙蝠侠', 538735, 82, 175, '2022-03-17 16:00:00', 1690, '布鲁斯·韦恩化身蝙蝠侠于哥谭市行侠仗义两年后，罪犯皆闻风丧胆，他也因此深入接 触到哥谭市的阴暗面。他潜行于哥谭市腐败的政要名流关系网中，身边仅有的几个值得信赖的盟友——管家阿尔弗雷德·潘尼沃斯与詹姆斯·戈登警长。这位独行的“义警侠探”在哥谭市民心中已成为“复仇”二字最当仁不让的代名词。', 'https://gw.alicdn.com/i3/O1CN01hCzZj31tFQRX31SQ6_!!6000000005872-0-alipicbeacon.jpg'),
('喜羊羊与灰太狼之筐出未来', 1215777, 95, 94, '2022-02-01 00:00:00', 2898, '电影将延续剧集《喜羊羊与灰太狼之筐出胜利》的故事，喜羊羊、灰 太狼与一众小羊组成的守护者队进入篮球顶级赛事决赛，但却意外地败北，团队分崩离析。\r\n虽然各散东西，但对篮球的热爱和对冠军的渴望让大家再次组队，参加新一届大赛，然而这次的对手更强大，他们面临更大的挑战！', 'https://gw.alicdn.com/i2/O1CN01r6dQiQ1jeTwcn0J8A_!!6000000004573-2-alipicbeacon.png'),
('遇见你', 1217066, 0, 0, '2022-04-30 16:00:00', 0, '故事从遇见初恋开始。一直被同学嘲笑为“垃圾桶”的余骄阳遇见了她青春里的“白月光”周灿。在“灿烂骄阳”八年的爱情长跑里，时间定格下二人幸福甜蜜的恋爱生活点滴。余骄阳大胆去爱，从未后悔，一直在为他们的未来不懈努力着。只是为了某一天，自己可以成为\r\n周灿的新娘。终于，周灿结婚的那天，余骄阳如约出现……', 'https://gw.alicdn.com/i1/O1CN01BzRicw1VvW3sa9h9A_!!6000000002715-0-alipicbeacon.jpg'),
('错乱空间', 1264555, 0, 87, '2022-03-24 16:00:00', 1898, '一队青年男女踏入古老的黑水城地域，深陷走不出的迷途险境、逃不掉的死亡魔咒！阴森月夜，魅影追杀，危机重重……究竟是来自古老的诅咒，还是来自灵魂深处的疑窦？真相浮出古城的那一刻，真实虚幻重叠交错，极致恐怖一触即发！', 'https://gw.alicdn.com/i2/O1CN01wzUIvl1y42fvICBGF_!!6000000006524-0-alipicbeacon.jpg'),
('新灰姑娘', 1284304, 80, 87, '2022-03-24 16:00:00', 1898, '性格特别的老鼠们请求灰姑娘参加皇宫舞会。在半桶水魔法师莉莉的帮助下，灰姑娘换 上了华丽的行头，出发到皇宫。到了皇宫中，意外发现了皇宫里的王子是假冒的，一切都是巫师的阴谋。为了拯救真王子，灰姑娘与三只小老鼠踏上了冒险的旅程，寻找能打破魔咒的神戒。究竟谁是真王子？灰姑娘的故事是否有着童话般的完美结局？', 'https://gw.alicdn.com/i3/TB1GPA2dxTpK1RjSZFKXXa2wXXa_.jpg'),
('镜世界', 1285671, 0, 85, '2022-04-02 10:00:00', 0, '午夜黑暗房间，镜前点蜡烛占卜，穿红衣削苹果，如皮断了，将在镜里看到不干净 东西。本身对镜子有心理阴影的少女姗姗，被她的同学拉去参加一场恐怖的镜子游戏，不慎削断果皮，受镜中不明事物惊吓不省人事，数日没有苏醒，身体开始发生异样地扭曲。姐姐为唤醒弥留的妹妹，参加一个能进入沉睡者脑中意识空间的恐怖实验，在极度恐怖的意 识异境中寻找迷失的妹妹……', 'https://gw.alicdn.com/i2/O1CN01is57Q629IChJWGdA0_!!6000000008044-0-alipicbeacon.jpg'),
('囧男进化论', 1301156, 0, 105, '2022-03-24 16:00:00', 0, '讲述了三年前，郝大毅（罗翔 饰）曾是一名景区规划师，合伙人盗走了他的 心血，并把他赶出了公司。从此大毅患上了社交恐惧症，变得胆小自卑，对谁都不太信任的故事。', 'https://gw.alicdn.com/i4/O1CN01GIk3Xf262gQQwfJTK_!!6000000007604-0-alipicbeacon.jpg'),
('精灵旅社4：变身大冒险', 1304398, 0, 88, '2022-04-03 00:00:00', 0, '火爆全球的系列动画电影《精灵旅社》迎来大结局，十年经典欢乐完结！在精灵旅社125周年庆典派对上，一场意外使德古拉带领的精灵家族首次变身成人，而约翰尼则成了怪兽。为了寻找治疗方法，这对冤家翁婿前往危机重重的南美雨林开启了一场欢乐又刺激的冒险之旅，遭遇了种种令人捧腹的窘况。得知消息的梅菲斯带领精灵家族前去营救爱人和老爸，他们最终能否将一切恢复正常？', 'https://gw.alicdn.com/i1/O1CN01CqnvNh1dEwAJL5ruq_!!6000000003705-0-alipicbeacon.jpg'),
('致我的陌生恋人', 1314331, 0, 118, '2022-04-13 16:00:00', 0, '拉斐尔与奥莉薇亚在高中一见钟情。奥莉薇亚弹得一手好钢琴，而拉斐尔打算写科幻小说。经过十年幸福的婚姻生活之后，拉斐尔成了所谓的一位畅销作家。被眼前的成功冲昏了头脑，拉斐尔变得自大而虚荣，感到自己与奥莉薇亚的距离越来越远。在拉斐尔与奥莉薇亚发生激烈争吵之后，他醒来发现自己成了平行人生里的一名中学乒乓球老 师，每日与自己的发小厮混在一起。拉斐尔开始意识到奥莉薇亚才是他的一切，决定不惜一切代价赢回奥莉薇亚的芳心。而在这个平行世界里，奥莉薇亚是一位世界著名的钢琴家，从未见过拉斐尔。', 'https://gw.alicdn.com/i4/O1CN01yPu0bb1kuLHdmXs5Y_!!6000000004743-0-alipicbeacon.jpg'),
('印度女孩', 1326861, 86, 120, '2022-03-17 16:00:00', 1690, '出身贫民的印度女孩蔻茜从小热爱板球运动，立志要进国家队，却面对性别、出身及社会给予的重重阻挠，更难逃失败就要服从结婚生子的命运。这样一个人人都瞧不起的贫民女孩，最终会逆袭成为国家“宠儿”吗？', 'https://gw.alicdn.com/i4/O1CN01f0XTvl1g9ODZ22uCv_!!6000000004099-0-alipicbeacon.jpg'),
('可不可以你也刚好喜欢我', 1334691, 0, 107, '2022-03-11 03:11:00', 1898, '中国台湾年度爆款爱情电影，由《比悲伤更悲伤的故事》创作团队打 造，邓紫棋演唱主题曲《很久以后》。影片讲述了暗中喜欢着青梅竹马李助豪的女生田筱湘，借由塔罗牌算出了告白的最佳时机，但没想到要告白时，李助豪竟先和她的好友告白！？筱湘的初恋会有结果吗？', 'https://gw.alicdn.com/i4/O1CN01uWaOwm1QrKMJAW1Ku_!!6000000002029-0-alipicbeacon.jpg'),
('被害人', 1335432, 0, 0, '2022-04-01 16:00:00', 0, '10年前的一个夏夜，警官袁文山（冯绍峰 饰）接到一起抢劫杀人案，在逐渐深入的 调查过程中，当晚在场的嫌疑人们逐一浮出水面，然而案情的真相远非表面那般简单，三案并行，一场利益和正义的较量愈演愈烈，卷入其中的人们都是所图为何？究竟是情法之争，还是欲望驱使？在案件稍有眉目之时，袁文山却发现了一个被自己忽略的重要线索... ...', 'https://gw.alicdn.com/i3/O1CN01IV0ybo1kaeEsYtVpj_!!6000000004700-0-alipicbeacon.jpg'),
('新灰姑娘2', 1335748, 0, 90, '2022-05-31 16:00:00', 0, '为了帮助王子艾利克斯解开魔咒，灰姑娘艾拉带着魔法师莉莉，以及沃尔特和曼尼两只老鼠朋友再度出发寻找生命宝石，但朋友莉莉却在冒险中为了保护艾拉而牺牲，拿回生命宝石的艾拉面临着一个选择，究竟是帮助王子，还是救回朋友？', 'https://gw.alicdn.com/i4/O1CN012IUTHJ1WZouebANXQ_!!6000000002803-0-alipicbeacon.jpg'),
('卧鼠藏虫', 1335830, 0, 91, '2022-03-24 16:00:00', 1898, '一个月，一百万，演霸总！黑中介（贾冰饰）将小镇青年（文松饰）意外送到大富豪（张晨光饰）轮船上，未曾想误打误撞，人生开挂，华丽变身东南亚酷帅霸总，春风得意！殊不知，他已陷入一场惊天阴谋！爆笑奇趣的阴差阳错中，洗脑大师、街头霸王三人组、诊所情人、白富美大小姐、神奇“光头强”、奇葩劫匪等“龙虎鼠虫”纷纷登场，共同演绎 一场多线索爆笑喜剧大戏。小人物的命运碰撞，让人笑中带泪，爽爆开心。《卧鼠藏虫》由文松、贾冰、张晨光、崔志佳、周浩东、代乐乐、艾如、夏梓桐、李世鹏、马赫、郭子歆等众明星联袂奉献，定档2022年3月25日，横跨清明小长假，众星笑闹春季档！不做鼠！不做虫！要当虎！要当龙！看个喜剧，春风得意！', 'https://gw.alicdn.com/i1/O1CN01CHNk1q1aTBe7f1ntH_!!6000000003330-0-alipicbeacon.jpg'),
('野夏天', 1336286, 0, 114, '2022-03-24 16:00:00', 2690, '你我的人生是历经一场又一场的赛道，这次跑道上是充满盼望的中学跑步队员与怀才不 遇又奋力一搏的跑队教练。\r\n作为一个目击者的作家吴又立，原来只想侧写这些少年的汗水与激情，但从远方来的她，却成了赛道上的不速之客。背叛横刀划开的伤害，流逝在那夏天燥热与不安的空气里，在跑道上扬起的灰尘里，湿润的双眼里，心碎的痛楚里……', 'https://gw.alicdn.com/i3/O1CN01YLskJB1DHympJ8jMY_!!6000000000192-0-alipicbeacon.jpg'),
('我是真的讨厌异地恋', 1336300, 0, 100, '2022-04-28 16:00:00', 0, '要相信：熬过异地，就是一生。故事围绕赵一一（任敏 饰）和许嘉 树（辛云来 饰）展开，高考之后，赵一一终于向暗恋多年的许嘉树表白，却阴差阳错开启一场异地恋。他们坚信：熬过异地，就是一生。可远距离恋爱的天然阻碍考验着他们，明明相爱，却不断缺席对方的生活。赛赫（陈宥维 饰）的出现以及闺蜜乔乔（周雨彤 饰）和李唐（李孝谦 饰）一波三折的爱情都让赵一一感触良多。当异地恋升级为异国恋，是继续坚持，还是一别两宽，各自成长的二人不得不面对自己内心的答案…', 'https://gw.alicdn.com/i2/O1CN019jbnNU1P7EtJcFOCd_!!6000000001793-0-alipicbeacon.jpg'),
('检察风云', 1337406, 0, 100, '2022-04-29 16:00:00', 0, '中国刑事犯罪检察题材电影重磅推出！\r\n大学教授夏薇（王丽坤饰）涉嫌故意杀人，舆论发酵失控，多方压力涌来。随着检察官李睿（黄景瑜饰）和同事张有成（王千源饰）对该案进行审查，发现作恶多端的富商陈鑫（包贝尔饰）与此案密切相关，一桩深埋多年的旧案被牵出…故意杀人案、强奸案、官商勾结 环环相扣，所有人都被迫卷进这场命运的漩涡。李睿与夏薇辩护律师童雨辰（白百何饰）在法庭上激烈交锋，夏薇究竟为何沉默不语？她的丈夫洪俊山（冯绍峰饰）又隐藏了什么秘密？正邪敌我难辨，无法预料的危机等待着众人…', 'https://gw.alicdn.com/i3/O1CN01ItNd5N28wg4HE6mGx_!!6000000007997-0-alipicbeacon.jpg'),
('哥，你好', 1339846, 0, 112, '2022-04-29 16:00:00', 0, '喜剧王炸组合强势回归，这个五一，笑过假期！\r\n与父亲老伍（魏翔 饰）终年不合的小伍（常远 饰）阴差阳错回到80年代，意外搅黄了父亲与母亲大陆（马丽 饰）的初次相遇。为了纠正这个错误，他想尽办法一次次重返过去，鼓励老妈追老爸，让人啼笑皆非的闹剧不断上演。父母相遇相恋的命运，是否会因为小伍的干预而转变？尘封在父亲心里的秘密，又将如何慢慢揭开……', 'https://gw.alicdn.com/i2/O1CN01D1GIEu1iGpseZGKSC_!!6000000004386-0-alipicbeacon.jpg'),
('花束般的恋爱', 1343325, 88, 124, '2022-02-21 16:00:00', 1690, '影片是《四重奏》导演土井裕泰，编剧坂元裕二的大银幕首部合作作品。故事讲述男女主人公因在东京明大前站错过末班电车而偶然相识，之后展开时代、时间、地点、全部的偶然都像命运一样同步的5年恋爱，展现了他们在既非大人也非孩童的时期里，迷茫前行的模样。', 'https://gw.alicdn.com/i2/O1CN01zm2YwX264yOztOlWL_!!6000000007609-0-alipicbeacon.jpg'),
('我的体育老师', 1344595, 0, 105, '2022-01-06 16:00:00', 2300, '《我的体育老师》是一部由知名导演周勇执导，陶玉玲、王奕盛、孙洪涛、周浩 东、沈丹萍、郭晓晓等老戏骨加盟，聚焦中学生体育课的小成本热血青春电影。讲述的是南武中学新来的体育老师刘昊辰，在其他老师频频“霸课”和家长们同样认为“体育课不重要”的情形下，他坚持捍卫学生们上体育课的权利并最终为同学们“抢”回了属于他们体 育课的感人故事。影片风格青春励志，喜剧元素丰富。该片针砭时弊，直击了忽视体育根深蒂固的顽疾，对于当今激发和推动全民热爱体育、关注健康，尤其是对传播青少年体育教育的正确理念，严禁挤占体育课，有着积极的现实教育意义。', 'https://gw.alicdn.com/i1/O1CN01dpLI1C1atkWQBUJTD_!!6000000003388-0-alipicbeacon.jpg'),
('如果有一天我将会离开你', 1346785, 0, 108, '2022-03-11 10:00:00', 2990, '交换生李小李（谢承泽 饰）来到日本东京偏僻的“渊野边”留学一年。呆板木讷的他一心想要打工却屡屡碰壁，终于在老同学邱邱（邱天 饰）的帮助下找到一家中华料理店。代理店长管唯（齐溪 饰）收留照顾他、店员青木（牛超 饰）视他为情敌、后厨大师傅老万（陈永忠 饰）小师傅宋哥（宋宁峰 饰）倒都对他爱答不理……李小李的到来打破了地下一层的沉寂、也卷入进每个人的生活之中。时间稍纵即逝。下一个春天到来前、有人留下，有人离开，而那些刚刚羁绊成型的“限定亲情、临时友情、类似爱情”又会何去何从？', 'https://gw.alicdn.com/i4/O1CN01ellZls1D07LAJWpG2_!!6000000000153-0-alipicbeacon.jpg'),
('戏是人生', 1352615, 0, 102, '2022-04-21 16:00:00', 0, '三十年代，潮剧在逐渐的衰落。虽然依旧有喜爱潮剧的人在坚守这份传承和文化，但在那个动荡时期的冲击下，潮剧如同被潮水蹂躏的礁石，时隐时现。林尽在年幼时，母亲迫于生计，将其卖到潮剧班成为童龄演员。这一刻林尽无疑是最悲惨的，父母的抛弃，练功的艰苦，但林尽从一开始的不喜欢到后来渐渐地爱上潮剧。随着林尽的技艺越发成熟 ，他的天赋也随着显露。没几年的时间，林尽与狗散这对搭档逐渐走红。正当林尽的人生开始花团锦簇的时候，人生再次和他开了玩笑，林尽，失声了……', 'https://gw.alicdn.com/i3/O1CN01MFGwGE1km693dKwww_!!6000000004725-0-alipicbeacon.jpg'),
('杨得操家的幸福', 1354702, 0, 97, '2022-03-28 16:00:00', 0, '电影《杨得操家的幸福》围绕幸福是奋斗出来的主题，讲述了通过激发主 人公杨得操反衬人物胡能两家人的内生动力，树立脱贫的自信心；通过精准扶贫与扶志扶智结合，摒弃“歇帮”和“等、靠、要”行为；通过发展养羊种草和民俗香包产业成立“331+”多形式合作社带动村民致富；通过对扶贫对象原型的真实故事进行艺术形象加工，增 强跌宕起伏的感染力；通过扶贫工作队和村干部的精准帮扶，助推贫困户和贫困村改变面貌，赢得幸福！', 'https://gw.alicdn.com/i1/O1CN01VVgqtv1On5Sqogq5i_!!6000000001749-0-alipicbeacon.jpg'),
('狙击手', 1354885, 93, 96, '2022-02-01 00:00:00', 1990, '影片根据抗美援朝战争“冷枪冷炮”运动中神枪手群体事迹改编。1952年冬至1953年初， 中国人民志愿军与联合国军在朝鲜战场形成僵持，双方发起了低强度的密集狙击战，史称\"冷枪冷炮运动\"。在连长（张译 饰）带领下的狙击五班战士枪法过人，成为敌军的心头大患，班长刘文武（章宇 饰）更成为重点狙击对象。为重创狙击五班，敌方调配精英狙击小 队，配以最先进的武器装备，更迫使狙击五班战士大永（陈永胜 饰）等人为救同伴进入其设好的险境之地。但正当敌军打响自己如意算盘之时，他们未料到，被他们当作诱饵的侦察兵亮亮（刘奕铁 饰）身上其实隐藏着更大的秘密......', 'https://gw.alicdn.com/i1/O1CN01LHrnMo20OJPpcoBj9_!!6000000006839-0-alipicbeacon.jpg'),
('我心飞扬', 1357416, 91, 104, '2022-02-25 02:00:00', 3800, '电影《我心飞扬》灵感源自中国冬奥金牌零的突破，讲述冬奥健儿拼搏进取、为国争光的故事。1980年中国代表团开始参加冬奥会，屡次与金牌失之交臂，失败与不甘像针一样狠狠刺痛中国人的心。为实现零的突破，秦杉组建以杨帆为代表的中国短道速滑国家队，临危受命立志一雪前耻。两人向金牌发起冲击，师徒关系也面临着激烈的碰撞和重重考验… …', 'https://gw.alicdn.com/i4/O1CN01ymjOk71NqSlG3qPl6_!!6000000001621-2-alipicbeacon.png'),
('钟馗伏妖', 1357534, 0, 85, '2022-03-18 01:00:00', 1990, '根据民间传说“钟馗伏妖”故事改编。每逢千年便有日食天象，届时更是昆仑山灵力最弱，阴气最盛之时。此时，昆仑山魔井开启，魔能涌出。妖魔或附身于常人，夜间吸食人类阳气，被侵蚀的人们诡异而凶残；或化为人形捕食人类。恐怖灵异事件不断，你我之间难分人妖，人间如地狱般阴郁恐怖。终南山进士钟馗不惧邪祟，与师傅一起斩妖除魔，却发 现在妖身后，还有更惊人、更令人恐惧、更令他难以抉择的真相在等待着他…', 'https://gw.alicdn.com/i2/O1CN01SojXSg1ZZJK2mULi8_!!6000000003208-0-alipicbeacon.jpg'),
('断·桥', 1358801, 0, 0, '2022-06-01 16:00:00', 0, '黄雀市大桥突然垮塌，桥墩中一副被活埋多年的人骨赫然惊现。死者女儿闻晓雨（马思纯 饰）为追查父亲死因，得到一个自称孟超（王俊凯 饰）的男孩协助，并携手走上探寻真相与复仇之路。渐渐地，他们发现，闻晓雨的养父朱方正（范伟 饰）很可能就是杀人凶手，而他背后似乎隐藏着惊天的秘密…', 'https://gw.alicdn.com/i3/O1CN01SCU9DI1IQI2dsGE1V_!!6000000000887-0-alipicbeacon.jpg'),
('“炼”爱', 1359708, 0, 97, '2022-03-17 16:00:00', 3300, '本片真实地记录了生活在都市的五位单身女性：有人想谈一场不分手的恋爱，有人则相信冻卵才是“最有价值的投资”，有人在家人催促中往返于各个婚恋活动，有人则是把希望寄托在社交软件, 还有人肩负起单亲妈妈的重任……不同的成长背景、迥异的价值体系，但她们正在面对人生中同样的情感命题——在城市化，网络化的多元时代里，我们面对情 感失去了什么？抛弃了什么？忽视了什么？', 'https://gw.alicdn.com/i1/O1CN01zAnsZm1ZyxUzZjbaL_!!6000000003264-0-alipicbeacon.jpg'),
('一周的朋友', 1361292, 0, 106, '2022-04-01 16:00:00', 0, '胜华高中的复读班上，新来了一个转学生林湘之（赵今麦饰），她文静聪明却总是孤独一人，不跟其他的同学做朋友。但这样的她却吸引了班上的学渣徐又树（林一饰）和古灵精怪的宋晓楠（沈月饰）、和高冷学霸蒋吾（汪佳辉饰）的注意。在徐又树不断想跟林湘之做朋友的过程中，发现了林湘之的秘密，原来她患了一种特殊的疾病，她对朋友 的记忆只有七天。为了帮助这个孤独的女孩，徐又树反而更加积极，四个人组成了“末日生存”小队不断为她创造惊喜和属于他们的记忆。殊不知，林湘之的疾病背后却有个更悲伤的秘密......影片根据叶月抹茶同名漫画改编，4月2日全国院线上映。', 'https://gw.alicdn.com/i4/O1CN01FZrDfY1PGrCxzTR4r_!!6000000001814-0-alipicbeacon.jpg'),
('好想去你的世界爱你', 1361354, 88, 95, '2022-02-14 00:00:00', 2590, '这世上是否有个人知你冷暖，懂你悲喜？身处北京的助理建筑师安易（周依 然 饰）与远在德国的调音师高昂（施柏宇 饰），因一场意外脑电波相连，从此他们听觉、味觉、触觉神奇共享。“被迫绑定”的日子，使他们方寸大乱，笑料百出，却也因为无时无刻的陪伴成为了互相最懂彼此的人...... 但一次误会使二人产生了隔阂，面对遥远的距离，未知的将来，他们是否会坚定地去往对方的世界？\r\n感谢那些看透了我们，却一直陪在我们身边的人。', 'https://gw.alicdn.com/i1/O1CN01aUHTwL1EnrynO3vi1_!!6000000000397-0-alipicbeacon.jpg'),
('最后的真相', 1361516, 0, 0, '2022-04-01 16:00:00', 0, '落魄律师丁义峰接到一桩法律援助，案情看似证据确凿。他决心以“无罪辩护”东山再起，嫌疑人金喜妹却一心求死。重重迷雾下，真相扑朔迷离。', 'https://gw.alicdn.com/i1/O1CN01880OT11K4skTHdQwX_!!6000000001111-0-alipicbeacon.jpg'),
('四海', 1361607, 92, 128, '2022-02-01 00:00:00', 1990, '在码头做摩托车特技表演顺便拉客的年轻人吴仁耀，他多年不见的浪荡父亲吴仁腾；梦想大城市生活的餐馆服务员周欢颂和他浮夸真诚的哥哥周欢歌。一支从没有赢过一场比赛的“不败传说”车队频频出战，一群可笑又可爱的小人物命运交织。阿耀和欢颂都立志活成自己亲人的反面，想彼此取暖，彼此独立，却又总不在一个频道上。世事无常，他们不得不背 井离乡，迎接一场未知旅途，阿耀的一身技能竟会用在一个自己都意想不到的场合，他的亲情友情和爱情最终又将会是如何…', 'https://gw.alicdn.com/i4/O1CN01WBNQnK1qP5wptLmrt_!!6000000005487-0-alipicbeacon.jpg'),
('遇见你之后', 1361684, 0, 102, '2022-04-14 16:00:00', 0, '最幸运是遇见你，最遗憾也是遇见你。当黄曼曼遇上彭柏杨的那天，她以为自己遇到了生命中最懂自己的人，没想到这份爱还是败给了现实，只想爱人幸福的柏杨，也低估了曼曼想跟他走下去的决心。', 'https://gw.alicdn.com/i2/O1CN01UvXQ8z1T71ACt56PH_!!6000000002334-0-alipicbeacon.jpg'),
('暗恋·橘生淮南', 1361814, 0, 0, '2022-05-19 16:00:00', 0, '有多少人的青春是从一场暗恋开始的？儿时的一次偶遇，少年时期的默默竞争，大学的意外重逢，洛枳（张雪迎 饰）对盛淮南（辛云来 饰）的漫长暗恋，最终会收获何种结局？影片改编自八月长安振华系列，为电影《最好的我们》续篇。', 'https://gw.alicdn.com/i2/O1CN01M2934m1JAY2Rl6ljv_!!6000000000988-0-alipicbeacon.jpg'),
('玛纳斯人之失落的秘境', 1362130, 0, 90, '2022-03-18 16:00:00', 2990, '100年前一支考古探险队无意中发现一处秘境，却因地震全部葬身此地， 仅留一段传奇故事流传于坊间。100年后，玛纳斯文化研究员马文俊离奇死亡，其女马思语得知父亲生前留有西域的秘密，而前往找寻。与此同时，觊觎该秘密的假富翁钱万里用计诱导前小野队乐队成员前往西域，小野队和马思语阴差阳错之间组团，共同在西域开启了磨难重重的寻找秘境之旅。', 'https://gw.alicdn.com/i1/O1CN01sdPudQ1yRrGrKthLf_!!6000000006576-0-alipicbeacon.jpg'),
('你是我的春天', 1362336, 0, 0, '2022-04-01 16:00:00', 0, '双影帝影后集结，献给每一个努力生活的“你”和“我”。影片由中国电影家协会指导拍摄，陈道明任总监制，黄渤任监制，实力派演员强力加盟演绎人间温情故事。倔强的人为了爱人奔走在空城，讨血汗钱的农民工巧合下驰援武汉，抗疫前线的人们除了顶着高压还要学会告别，后方阵地的社区工作者照顾居民却把风险留给了自己，平时疏于交 流的父子也被迫日夜相处。总有一些措手不及的事情发生，但也总有一颗治愈的种子在人们心中生根发芽。这场有关于春天和希望的电影，要和想见的人一起去看。', 'https://gw.alicdn.com/i2/O1CN01kFgy6E1T719prDyyy_!!6000000002334-0-alipicbeacon.jpg'),
('安魂', 1363274, 0, 107, '2022-03-24 16:00:00', 0, '影片主要讲述主人公唐大道（巍子饰）因为自己的固执和偏见，间接使得儿子唐英健（强宇饰）一直活在阴影之下，终日郁结最后病发离世。唐大道和妻子瑞英（陈瑾饰）在精神受到沉重打击之时，借与一个与儿子长相酷似的青年对话表达了痛彻肺腑的伤感和忏悔，在这过程中重新认识人生，获得开始新生活的勇气。', 'https://gw.alicdn.com/i3/O1CN01pU0iQy25TsKOZgILu_!!6000000007528-0-alipicbeacon.jpg'),
('边缘行者', 1363308, 0, 0, '2022-04-14 16:00:00', 0, '1997年回归前夕，多方势力矛盾激化，暴力事件频发。\r\n巨变当前，黑帮龙头林耀昌（任达华 饰）对亲信阿骆（任贤齐 饰）委以帮派重任。多重身份的阿骆在黑白边缘行走，一场除暴行动正悄然掀开反杀的序幕。', 'https://gw.alicdn.com/i1/O1CN01fyKWoS1eDqqKPzqdg_!!6000000003838-0-alipicbeacon.jpg'),
('柳浪闻莺', 1365331, 82, 106, '2022-03-05 01:00:00', 3690, '电影《柳浪闻莺》改编自茅盾文学奖得主王旭烽系列小说《爱情西湖》， 故事以西湖 十景之一的“柳浪闻莺”为背景，主要讲述了上世纪90年代江南越剧团两个姑娘与一个画家间的情感纠葛。极具天赋的女小生垂髫，与花旦银心自幼相识，一起在戏班子长大，两人性格迥然不同，但情同姐妹。垂髫至情至性，为舞台而活；银心看似单纯天真，实则是个 知进退、会钻营的女孩。她俩本是彼此眼中最重要的那个人，可世事无常、种种分歧纷沓而至，特别是杭州画家工欲善的出现，让相依为命的两个女孩变得相爱相杀。时代变迁，越剧由盛转衰，垂髫与银心的命运与越剧一同沉浮。曲终人散之时，放眼世间，她最放不下 的那个人，还是她。', 'https://gw.alicdn.com/i2/O1CN01WOLYEW1c3COonOH3Q_!!6000000003544-0-alipicbeacon.jpg'),
('爱犬奇缘', 1368202, 0, 0, '2022-05-19 16:00:00', 0, '电影讲述了三组养狗的单身男女，他们因狗相识结缘：当愤世嫉俗的宠物医生狗王陈（冯绍峰饰）在给狗治病时邂逅了认为钱才能给自己安全感的千菲菲（娜扎饰）；当渴望爱情的程风（刘以豪饰）与爱情悲观主义者小雪（辣目洋子饰），在彼此狗狗的牵引下擦出爱的火花；当宠物美容师魏小楠（卜冠今饰）和讨厌狗的父亲魏国明（杜源饰）一起收 养流浪狗，还暗恋上养了很多狗的男神王子成（姚弛饰）……三对男女，四只狗狗，一段爱情奇缘即将上演……', 'https://gw.alicdn.com/i4/O1CN01UvrQ7K1Cvzm8PPDVa_!!6000000000144-0-alipicbeacon.jpg'),
('熊出没·重返地球', 1368327, 94, 99, '2022-02-01 00:00:00', 2290, '有点懒又有点馋的熊二虽然总是各种失误犯错，内心却一直梦想成为一位英雄 ，以此获得大家特别是哥哥熊大的认可。一块外星原核的坠落打破了狗熊岭的平静，熊二意外的与外星原核合体，成为了拥有外星智慧能量的熊!随之而来的是“外星人”阿布的抢夺。阿布为了夺回原核，故意制造事端，让熊二众叛亲离。就在阿布将要成功的时候，一支神秘高科技军团的攻击彻底打乱了计划，导致熊强组合甚至整个地球于巨大的危难之中。阿布隐藏的身份以及来到地球的真正目的到底是什么？神秘的高科技军团背后有何故事？自暴自弃的熊二能否振作起来实现他的英雄梦？他们能否挽救地球的危机？', 'https://gw.alicdn.com/i2/O1CN013yiqKz28ZmH05yYwM_!!6000000007947-0-alipicbeacon.jpg'),
('我是霸王龙', 1369751, 0, 80, '2022-04-29 16:00:00', 0, '恐龙之王巅峰对决！作为地球有史以来最大的陆地生物，恐龙一直对人类有着 强烈的吸引力。穿越6500万年前白垩纪晚期，走进一个神秘五彩斑斓的恐龙新世界，生动再现奇特而壮观的史前时代，一段关于陆地最强王者霸王龙惊险刺激的冒险即将呈现...', 'https://gw.alicdn.com/i3/O1CN01XdtMeV1mpseQZJF0V_!!6000000005004-0-alipicbeacon.jpg'),
('年少有你', 1371945, 0, 96, '2022-03-17 16:00:00', 1990, '墨彩宁（张善南 饰）是一名普通的高中学生，因为班主任（王天宇 饰）就是自家小姨，所以自己的一举一动都逃不过小姨的法眼，平日只好伪装成乖乖学生，但本质上却是一个不折不扣的追星达人。转校生顾天琦（李明源 饰）的到来让她本来平静的生活发生了巨大转变，她发现这位引人注目的同桌竟是偶像顾云凡（区天瑞 饰）的亲弟弟，在顾天琦的 嘱咐下，墨彩宁答应保守住这个秘密。可特殊身份的消息还是不胫而走，也因此与闺蜜张公主（郭素洁 饰）产生了误会，为了能让张公主不再难过、顾天琦不再转学，墨彩宁与同学袁迟（范云飞 饰）、同学童辉（李炎峰 饰）等人团结一心解决了困扰。在相处中，墨彩宁决心要成为像顾天琦一样优秀的人。转眼到了寒假，在盛大的烟花下大家树立了各自的人生目标，带着珍贵的友谊走向憧憬的未来……', 'https://gw.alicdn.com/i4/O1CN01MG3l431LrGE12hd8Q_!!6000000001352-0-alipicbeacon.jpg'),
('人间世', 1372620, 0, 90, '2022-04-15 00:00:00', 3950, '电影《人间世》由陶涛、张琪、秦博、范士广四位导演共同执导，陶涛，张琪联合监制，秦博、范士广任总策划。影片选取两位身患绝症的病人，将目光聚焦于她们的家庭，记录下她们人生最后的时光，书写了一首关乎爱的生命诗篇。电影《人间世》是一部不同于电视版的大银幕作品，秉承对生命的敬畏，以全新的主题立意，构建不一样的叙事视角与故事 结构，将电影蒙太奇手法创造性融入真实感人的纪录影像，向电影中这些真实，可爱并飞扬着生命力量的人物致以最大的敬意。人间世，爱是感同身受的勇气，触手可及！', 'https://gw.alicdn.com/i4/O1CN01BpOEwW28tTIzYlmw8_!!6000000007990-0-alipicbeacon.jpg'),
('邓小平小道', 1372909, 0, 105, '2022-04-21 16:00:00', 0, '文革期间邓小平被革职下放江西，面临多重高压危机四伏，但始终保持坚毅、乐观，初心不改。为了他的安全，工厂师傅为他专门开辟了一条近道。三年零四个月，他每天沿着这条小道去工厂劳动，风雨无阻，后人称之为“邓小平小道”“小平小道”。他在坚持劳动的同时还要照顾瘫痪在床的大儿子，每天为他擦背翻身，终因劳累过度、营养不 良晕倒车间。危急时分，车间女工以一碗红糖水救了他。他深入基层感知群众生活的疾苦，得出“贫穷不是社会主义”的伟大结论，为他复出后进行治理整顿、改革开放奠定了坚实的思想基础。', 'https://gw.alicdn.com/i2/O1CN01ZdltqW1E5RWLW9k2b_!!6000000000300-0-alipicbeacon.jpg'),
('人生大事', 1374316, 0, 112, '2022-04-01 16:00:00', 3000, '殡葬师莫三妹（朱一龙 饰）在刑满释放不久后的一次出殡中，遇到了孤儿武小文（杨恩又 饰），小文的出现，意外地改变了莫三妹对职业和生活的态度。', 'https://gw.alicdn.com/i1/O1CN01iyKSuM1sSsSUGV9Em_!!6000000005766-0-alipicbeacon.jpg'),
('大圣降妖', 1376735, 0, 90, '2022-05-31 16:00:00', 0, '师徒发生内部矛盾引发妖童捉唐僧，悟空降妖过程中黑云仙趁机渔翁得利，唤醒 了上古魔兽饕餮，黑云仙操纵饕餮攻天庭、伐灵山搅乱了三界，最终悟空用自我牺牲化解了这场劫难，同时也唤醒了妖童心中的善念。', 'https://gw.alicdn.com/i3/O1CN01RzITFK29YgvXE9qPh_!!6000000008080-0-alipicbeacon.jpg'),
('迷失1231', 1378583, 0, 89, '2022-04-14 16:00:00', 0, '怪面魅影在幽暗午夜神秘游荡，黑衣飘摇，诡笑惊悚，不断侵扰尾随青年男主。 或在废弃仓库，或在深悠长廊，一次次挥舞利斧，用索命代价带走无尽恐惧。更为吊诡的是，男主人公却深陷在同一个残酷的日子不能自拔，一次次逃亡，一次次被杀，恐惧不断升级，迷失在奇异时空，逃无可逃……当终极真相震撼揭幕，真正的恐惧才伴随着巨大痛苦 彻底爆发！本片在青春时尚的快节奏叙事中，尽展密集吓点，又发人深省，是恐怖片迷必看佳作。', 'https://gw.alicdn.com/i1/O1CN018uzwMy1s7oEf6ZsAf_!!6000000005720-2-alipicbeacon.png'),
('奇迹·笨小孩', 1378685, 95, 106, '2022-02-01 00:00:00', 1990, '二十岁的景浩（易烊千玺 饰）独自带着年幼的妹妹来到深圳生活，兄妹俩生活温 馨却拮据。为了妹妹高昂的手术费，机缘巧合之下，景浩得到一个机会，本以为美好生活即将来临，却不料遭遇重创。在时间和金钱的双重压力下，毫无退路的景浩决定孤注一掷，而他陷入困境的平凡人生，又能否燃起希望的火花？电影《奇迹·笨小孩》是中宣部国家 电影局2021年重点电影项目，也是2021年重点建党百年献礼片，描述十八大以后新时代年轻人在深圳创业的影片。', 'https://gw.alicdn.com/i1/O1CN013Ggc2s1Z8HwrwxAfn_!!6000000003149-0-alipicbeacon.jpg'),
('这个杀手不太冷静', 1379792, 92, 109, '2022-02-01 00:00:00', 1990, '毕生追求男主梦的魏成功（魏翔 饰）终于得到了女明星米兰（马丽 饰）的“赏识”，被邀请出演她的男一号“杀手卡尔”，他兴致勃勃诠释角色的同时，却没想到已经落入了一场危机四伏的阴谋，但他依然借自己 “精湛”的演技和绝佳的运气化险为夷，而残酷的真相也离他越来越近……', 'https://gw.alicdn.com/i4/O1CN01B9S9Lf1MrY5iekWqL_!!6000000001488-0-alipicbeacon.jpg'),
('保你平安', 1380161, 0, 0, '2022-04-28 16:00:00', 0, '绰号“集安断尾虎”的昔日大佬魏平安，中年落魄，靠卖墓地为生，他的客户韩露“入住”后卷入一场谣言风波，面临墓地被“强拆”，为了一句承诺，魏平安想方设法试图查明真相，却发现散播谣言的人并不在乎真相，只在乎他们所相信的真相，而魏平安自己，也陷入了新的谣言。', 'https://gw.alicdn.com/i1/O1CN01wUooV91SjexjgdoGs_!!6000000002283-0-alipicbeacon.jpg'),
('梦想演说家', 1384495, 0, 95, '2022-03-25 16:00:00', 0, '故事讲述了一个不起眼的“小保安”通过努力一步步走向成功的故事。人生而 平等，但是有些人却是例外，他们在下生之日，仿佛就被命运“限定”了人生。不要说出人头地，就连做一个普通人，在他们眼里都是奢侈。故事的主人翁就是这个从出生就被“限定”的人，他天生口吃、外加听力障碍，童年遇到的嘲笑和排挤、青年看不到未来的抑郁 ，让他一度怀疑人生，但是就是这么一个口吃聋障的普通人家出来的孩子，却在长大后通过超出常人成百上千的努力，克服口吃、自学大学课程、做推销员、成为企业精英…摘掉了一个个限定的标签，将一个个不可能变成可能，最终凤凰涅槃、破茧重生，成就了一番传 奇人生。', 'https://gw.alicdn.com/i1/O1CN01eIigQz1ZPh0BUlQLt_!!6000000003187-0-alipicbeacon.jpg'),
('妈妈！', 1386263, 0, 120, '2022-05-07 16:00:00', 0, '讲述一位85岁母亲照顾65岁阿尔茨海默症女儿的亲情故事，用细腻的女性视角展现爱与亲情在生命尽头绽放出的无限力量。', 'https://gw.alicdn.com/i4/O1CN015bGJzR1Gc512k4T7g_!!6000000000642-0-alipicbeacon.jpg'),
('草原大作战', 1386473, 0, 82, '2022-04-02 16:00:00', 2800, '大灰是一只狼，英俊自负，梦想当上狼群的统领。老吉是大灰的强劲对手，与大灰竞争狼王的位置，他们决定比武一决胜负。就在比武的前夜，大灰不小心中了魔法，变身成一只羊。他不得不离开狼群，与羊群居住在一起。老吉趁老狼王不备，将其推下山崖夺得狼王之位。一只小羊偷跑到北方草场被狼群捉住，大灰将其救出。这个行为激怒了老吉，他 决定袭击羊群。得知狼群要袭击羊群的时候，大灰决定领导羊群与狼群抗争。在建设防线的时候，大灰被发现与狼群有瓜葛，失去了大家对他的信任。他不得不独自离开羊群，在路上他的到一个接触魔法变回狼的机会，但是同时得知狼群马上就要袭击羊群，他放弃变回 狼的机会，毅然回到羊群，带领羊群战胜了狼群。两个族群最后达成了和平协议。', 'https://gw.alicdn.com/i4/O1CN01IdpfnJ1zu5IfJOu1x_!!6000000006773-0-alipicbeacon.jpg'),
('诺亚方舟漂流记2', 1388369, 0, 86, '2022-04-07 16:00:00', 0, '诺亚方舟漂流在海上，数周都看不到陆地，方舟粮食库存在不断减少，食肉动物和食草动物之间脆弱的和平随时可能被打破。芬妮和莉亚连同船上最后的食物，在一次意外中落入海里。莉亚和新朋友果冻飘到一座岛屿上，而芬妮落入一个被火山威胁的同类部落里。方舟登岛，火山突然爆发，芬妮联同大家克服了危机后，再次开启新的征程。', 'https://gw.alicdn.com/i1/O1CN019McLYT1yOeVB0di2W_!!6000000006569-0-alipicbeacon.jpg'),
('陀螺女孩', 1389364, 0, 129, '2022-05-31 16:00:00', 0, '电影由邓安东执导，演员陶慧、张晨光、乌兰托雅·朵、曹炳琨、童蕾、王莎莎、王奎荣、杜旭东、苇青等主演，讲述一个小女孩儿在父亲突然离世，母亲突患精神疾病的情况下，靠自己的双手撑起一个家的励志故事。', 'https://gw.alicdn.com/i3/O1CN013R4kM91bfqALo8Of4_!!6000000003493-0-alipicbeacon.jpg'),
('读心者之深海', 1390573, 0, 87, '2022-03-10 16:00:00', 1690, '心理咨询师黄晓军经常帮助病人”解决心理问题，有一天吴教授为他介绍了一个叫赵立华的客户，赵立华经常可以在现实生活中看到”一个诡异的红衣女人”，这个红衣女人”无时无刻出现在他的身边，原来红衣女人”是他杀死”的女友，该女子曾为他穿上洁白的婚纱。红衣女子”到底要做什么，沉默中，红衣女人”忽隐忽现…令男主惊悚不已，毛 骨悚然。黄晓军决定一探究竟……', 'https://gw.alicdn.com/i1/O1CN01F2soB11et4UOCOcA7_!!6000000003928-0-alipicbeacon.jpg'),
('迷你世界之觉醒', 1391007, 0, 0, '2022-04-29 16:00:00', 0, '迷拉星的英雄之子卡卡，身体被邪恶力量入侵，随着少年长大，这份力量也在酝酿着毁天灭地的灾难，却又在冥冥之中指引着守护的道路……\r\n传说中的守护神黑龙，青梅竹马的部落公主妮妮，养育他长大的部落酋长巴拉贡，还有可爱捣蛋王熊仔，因信念集结，为守护而战！\r\n为了从虚空军团手中拯救部落，部落禁地、地底世界、异次元空间，还有食人花、大石龟等危机层出不穷！家园千钧一发，少年无畏昂首，只要拥有一颗守护的心，关山横槊万夫莫来！', 'https://gw.alicdn.com/i2/O1CN01Ko5tlB1j8scUqL5YH_!!6000000004504-0-alipicbeacon.jpg'),
('您好，北京', 1408747, 0, 105, '2022-04-29 16:00:00', 0, '《您好，北京》这部电影讲述了一位创业中年人，一位快递员和一位年轻的歌手，在北京奋斗生活的温暖励志感人故事。', 'https://gw.alicdn.com/i3/O1CN01uCbLHr1CEwXX6uMyp_!!6000000000050-0-alipicbeacon.jpg'),
('长津湖之水门桥', 1410040, 96, 149, '2022-02-01 00:00:00', 1990, '电影《长津湖之水门桥》以抗美援朝战争第二次战役中的长津湖战役为背景，讲述了在结束了新兴里和下碣隅里的战斗之后，七连战士们又接到了更艰巨的任务……', 'https://gw.alicdn.com/i1/O1CN01sSmj2b1daSm6IAUcs_!!6000000003752-0-alipicbeacon.jpg'),
('密案1922', 1411437, 0, 98, '2022-02-17 16:00:00', 2800, '民国诡杀夺命！白米埋尸噬魂杀，诡刃穿腹斩灵杀，是谁开启点名式索命？一幕幕“连环诡杀”怵目惊心，令人胆寒！名流豪绅接连遭遇夺命诡刃，留洋归来的推理天才接手米店惊天密案，却发现深陷无解迷局，一切似乎被复活的死者操纵！他却从毛骨悚然的死亡现场，从雨夜荒郊的孤坟中，发现了一段人鬼情未了的惊心往事……轰动一时的民国诡杀密 案，让所有人破胆寒心。', 'https://gw.alicdn.com/i3/O1CN016AV94T1sAYbQXi5AS_!!6000000005726-0-alipicbeacon.jpg'),
('珠峰队长', 1412368, 0, 83, '2022-05-13 10:00:00', 0, '每天生活两点一线的白领、卖掉自家小店的店主、背负沉重KPI的销售、在成功与失败间挣扎的创业者……8个普通人，带着各自的故事与梦想，在民间专业高山向导、队长苏拉王平的带领下，踏上了憧憬已久的珠峰之旅，也许，也是一次死亡之旅。他们在尼泊尔的珠峰南坡集结出发，穿越裂缝深不见底的恐怖冰川，攀上高达千米的蓝色冰壁，爬过山体岩石断面的“黄带”，朝着世界之巅一步步靠近。\r\n这支起初被外国队伍“看扁”的中国民间登山队，面对“窗口期”极短的恶劣天气和可能发生的冲顶“大堵车”，能否成为2019年全球第一支登顶珠峰的团队？\r\n本片是中国首部沉浸式体验攀登珠峰全程的电影，也是华语电影史上“最高难度”的纪录片——创下在8470米以上最高海拔完成无人机起飞航拍的新纪录。观众将跟随镜头“空降”珠峰攀登现场，与这群不甘平凡的普通人一起，为心中的热爱疯狂一次。', 'https://gw.alicdn.com/i3/O1CN01ClVSeR1zXdt8Jdfnu_!!6000000006724-0-alipicbeacon.jpg'),
('我们的冬奥', 1414515, 93, 90, '2022-02-19 00:00:00', 3000, '冰墩墩雪容融领衔主演，冬奥会唯一授权动画电影，打造开年最有意义的动画电影!  冰墩墩和雪容融在去参加奥运村的开村典礼时发生了一系列奇妙故事。小光头强与小熊大熊二一起帮助大家从暴风雪中脱险；九月偶然“捡到”冰墩墩，将其送回的同时收获完美假期；小虎妞在玩具的鼓励下勇敢面对挑战；大圣借“冰器”时遇到图图一起参加天宫冰雪 大会。从孙悟空到非人哉，片中集合30多位知名IP动画角色热血集结，唤醒五代人的童年回忆。', 'https://gw.alicdn.com/i1/O1CN01w14z5T1iAQLDlmocQ_!!6000000004372-0-alipicbeacon.jpg'),
('猪猪侠大电影·海洋日记', 1414984, 0, 85, '2022-04-29 16:00:00', 0, '超星特工猪猪侠在上次的任务中留下了后遗症，但他坚持独自潜 入海底世界执行新任务。\r\n在五彩缤纷的海底世界见识到各种各样的海底生物，结识了正在寻找哥哥的小豆芽，受小豆芽勇敢执着的精神所打动，猪猪侠决定帮助小豆芽，帮他一起寻找哥哥。\r\n原来海洋世界发生了一件不为人知的大事，导致大量海洋“居民”失踪。这件事并不简单，背后隐藏着一个危及海洋世界和平的大危机。猪猪侠这次要如何克服困难，突破自我，解除海洋大危机呢？', 'https://gw.alicdn.com/i4/O1CN01fHi9xT1x0Y2bAhUIP_!!6000000006381-0-alipicbeacon.jpg'),
('你是我的一束光', 1420661, 0, 106, '2022-02-25 00:00:00', 3900, '一位用生命守护群众的逆行者，一段不平凡而又揪心的爱情故事。职场、情场 都失意的音乐人穆随心（袁文康 饰）驱车前往云南，偶遇单亲妈妈彭彭（王西 饰），二人感情逐渐升温，发现了彼此身上的亮光，也触摸到了内心最深处的秘密伤口，彭彭内心深处无法走出的有关孙雨桐（邓超 饰）的心结也因此慢慢解开······', 'https://gw.alicdn.com/i4/O1CN019LnKBO1Nf0rYAM89K_!!6000000001596-0-alipicbeacon.jpg'),
('大国粮仓', 1421898, 0, 81, '2022-03-03 16:00:00', 3490, '纪录电影《大国粮仓》以“谁来养活中国？”开篇。以中国1949年新中国成立后，不同年代的彩色胶片（前苏联记者拍摄）画面新旧对比交替叙述，一幅幅朴实的生活画面真实、怀旧、感人。呈现了中国人从“吃得饱”向“吃得好”“吃的美”“吃得健康”的历史性转变，影片用镜头语言表述百姓故事，让普通百聚焦中国饭碗，以平民视角答疑解惑，了 解中国粮食安全。主创团队以袁隆平为首的清华、北大的农业学者，中国农业科学院的院士、科学家、“三农”人物共谋选题，创作团队分成6个摄制组，走遍了中国，采访了60余位“三农”专家、基层百姓。用史实验证焦裕禄精神、红旗渠精神，特别是以袁隆平为代表的农业科学家们耕耘出的“种子精神”的历史必然，阐述了中国共产党领导“三农”工作方针政策不断总结、修正、完善的史记。看大国粮仓丰收、储存、详实的数据，有力的告诉世界—中国人自己养活自己！中国人的饭碗牢牢端在自己手中，饭碗中装的中国粮。', 'https://gw.alicdn.com/i1/O1CN01NKEx511vFXltoMHpv_!!6000000006143-0-alipicbeacon.jpg'),
('刿心剑', 1422394, 0, 95, '2022-04-16 01:00:00', 0, '洪武年间，一起重大贪腐案渐渐浮出水面，为将整个贪腐网络连根拔起，锦衣卫暗 自出动彻查，谁破了案子便可升官得赏。丁武和蒋瑍是锦衣卫内一对亲如兄弟的小旗官，一个家有怀孕的老婆，苦于生计；一个爱上了青楼女子，需钱赎身。两人拼尽全力破案，为了爱人、为了兄弟、为了幸福，誓要立功改善现状。但案子屡屡受挫，线索接连中断。幕 后黑手似乎早有准备，锦衣卫内藏有眼线。眼看立功无望，急于救爱人的蒋瑍决定以身犯险。', 'https://gw.alicdn.com/i4/O1CN01nLgCzU20pKnoxHog0_!!6000000006898-0-alipicbeacon.jpg'),
('可不可以不要离开我', 1422668, 0, 0, '2022-05-19 16:00:00', 0, '电影《可不可以不要离开我》齐聚了陈乔恩、贾冰、卢靖姗、郭涛、吴樾、克拉拉、盛以婕、姜皓文等实力派当红演员，讲述了爱情中念念不忘又重逢的爱情，历经坎坷多年后相拥的爱情，生活中柴米油盐修修补补的爱情。有时候爱情是一个味道、是一种习惯、是一个季节、是一个地方。在这些平凡又不平凡的爱情中，我们看到了爱情的 伟大，看到了爱情的力量。', 'https://gw.alicdn.com/i3/O1CN015z7k8m1PcqDIJ7To2_!!6000000001862-0-alipicbeacon.jpg'),
('妖怪手表：永远的朋友', 1422962, 0, 100, '2022-03-11 16:00:00', 2300, '《妖怪手表：永远的朋友》以两个主人公的约定而展开，讲述了虽然很 贫穷却过得很幸福的少年“下町心”在唯一的亲人母亲过世后，落入了不幸的深渊。一位名叫“高城一希”的少年，也同样失去了姐姐。两个失去亲人的少年与一位能看见精灵的少女“有星多江”，以及“须大叔”、“猫又”、“河童”、“座敷童子”等善良可爱的精 灵妖怪，一起踏上了寻找亲人的冒险之路，小伙伴们温暖感人的友情故事也就此展开。即使山川异域，跨越时空，这份友情也决不能忘记！', 'https://gw.alicdn.com/i3/O1CN01iMJ4wz2695y1TTfDD_!!6000000007618-0-alipicbeacon.jpg'),
('岗上花开', 1423369, 0, 88, '2022-03-25 01:30:00', 0, '电影《岗上花开》以中国农村改革主要发源地小岗村为原型，讲述了“岗上村” 青年保田回乡创业受聘为基层干部，从土地使用、可持续开发入手，在农业产业发展、农村生态宜居、农民增收致富等领域积极探索的故事，展示了中国农村从“大包干”开始的改革发展历程，以及近年来落实乡村振兴战略、建设美丽田园综合体的生动实践和新型农民 对土地的认识与思考，呈现出中国农村、农民从物质生活到精神面貌的巨大变化。', 'https://gw.alicdn.com/i2/O1CN01yxoPMc1rJt4U4jgmj_!!6000000005611-0-alipicbeacon.jpg'),
('横山游击队', 1423384, 0, 96, '2022-12-30 16:00:00', 3100, '影片取材于上世纪三十年代初真实历史故事。讲述土地革命战争时期，陕北横山县连遭大旱，民不聊生。横山苦大仇深的穷苦人在共产党人的启发引导下，揭竿而起组成游击队，开展打土豪、分粮食同恶霸地主等反动势力进行殊死的武装斗争，为革命根据地建设作出了不可磨灭的贡献。', 'https://gw.alicdn.com/i2/O1CN01WNi3Ls266nzX1VWhB_!!6000000007613-0-alipicbeacon.jpg'),
('永不独行', 1423743, 0, 90, '2022-04-02 16:00:00', 0, '某足球俱乐部名将邓楚，人到中年在赛场上连遭失利而被俱乐部解聘。他决定带 全家自驾游以调整心情，然而途中却遭遇车祸；被抢救生还的他，认定是自己害死了妻子和孩子而无法自拔，于是他来到妻子老家山区小镇来照顾老岳父，尽孝“赎罪”。\r\n但岳父并不接受这个“害死”自己女儿的人，两个男人在这个偏僻的山村艰难地共处，邓楚忍气吞声，借酒消愁逃避现实生活；一天他的窗户玻璃被一群踢野球的留守儿童打破，这个偶然的小事件，改变了邓楚，他发现其中叫谢力杰的孩子是个踢球的好苗子，很像少年 时的自己，这群孩子也发现邓楚是个踢球高手，从此，迷失的邓楚与情感缺失的孩子通过足球发生一段动人而励志的故事......', 'https://gw.alicdn.com/i1/O1CN011LVjbmDR2fqLHmG_!!6000000001305-2-alipicbeacon.png'),
('草台班子：套路奇兵', 1425333, 0, 102, '2022-03-31 16:00:00', 0, '一个状况百出的草台班子剧组，在一处鲜为人知的神秘古代遗迹遭遇了一伙看似计划周密、装备精良、凶神恶煞的“国际文物大盗”。剧组不得不得负担起开始保护自身安全......', 'https://gw.alicdn.com/i1/O1CN01Tne2sd1q36wk1yDFJ_!!6000000005439-0-alipicbeacon.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `hall`
--

CREATE TABLE `hall` (
  `hid` int(11) NOT NULL,
  `hName` varchar(20) NOT NULL,
  `cid` int(11) NOT NULL,
  `capacity` int(11) NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `hall`
--

INSERT INTO `hall` (`hid`, `hName`, `cid`, `capacity`, `price`) VALUES
(1, '2号激光影厅 禁止饮食', 15879, 69, 0),
(2, '3号激光影厅 禁止饮食', 15879, 34, 0),
(3, '3号厅', 20780, 74, 0),
(4, '7号巨幕厅', 20780, 41, 0),
(5, '中国巨幕厅', 20780, 48, 0),
(6, '3号厅（三楼）影厅', 26244, 82, 0),
(7, '（中喜厅） 激光杜比巨幕厅', 26244, 44, 0),
(8, '1号三光路巨幕厅', 27434, 47, 0),
(9, '1号厅', 29820, 33, 0),
(10, 'Dmax 1全景声厅', 31012, 52, 0),
(11, '1号激光影厅（自备3D眼镜）', 31278, 38, 0),
(12, '5号VIP杜比全景声激光厅（禁止饮食）', 31278, 45, 0),
(13, '8号激光IMAX厅（禁止饮食）', 31278, 98, 0),
(14, '1号厅', 31323, 49, 0),
(15, '2号厅', 31323, 43, 0),
(16, '3号厅', 31323, 22, 0),
(17, '3号厅(观影需佩戴口罩)', 31491, 22, 0),
(18, '1号大银幕4k厅', 31665, 88, 0),
(19, '2号大银幕4k厅', 31665, 38, 0),
(20, '4号激光厅', 31665, 90, 0),
(21, '5号激光厅', 31665, 98, 0),
(22, '7号4k厅', 31665, 61, 0),
(23, '3号厅高亮激光巨幕厅（沉浸式立体环绕音效', 33201, 38, 0),
(24, '5号厅高亮激光厅（沉浸式环绕音效）', 33201, 84, 0),
(25, '6号厅高亮激光厅（沉浸式环绕音效）', 33201, 31, 0),
(26, '4号DTS:X厅', 36457, 44, 0),
(27, '5号厅', 36457, 83, 0),
(28, '1号杜比全景厅', 37914, 26, 0),
(29, '3号激光厅', 37914, 34, 0),
(30, '1号全景声厅', 38725, 28, 0),
(31, '2号美队厅', 38725, 55, 0),
(32, '5楼7号激光厅', 38725, 31, 0),
(33, '6号HelloKitty厅', 38725, 39, 0),
(34, '10号厅', 39192, 82, 0),
(35, '1号巨幕厅', 39192, 60, 0),
(36, '2号巨幕厅', 39192, 84, 0),
(37, '6号厅', 39192, 86, 0),
(38, '9号厅', 39192, 48, 0),
(39, '5号厅', 41599, 53, 0),
(40, '2号厅', 41797, 66, 0),
(41, '3号厅', 41797, 74, 0),
(42, '4号厅', 41797, 34, 0),
(43, '5号厅', 41797, 35, 0),
(44, '2号厅(凭票前台免费积分)', 43116, 45, 0),
(45, '3号厅(凭票前台免费积分)', 43116, 76, 0),
(46, '3号厅', 4541, 42, 0),
(47, '4号厅', 4541, 35, 0),
(48, '2号厅', 45411, 38, 0),
(49, '6号厅', 45411, 38, 0),
(50, '10号激光厅', 45618, 74, 0),
(51, '11号激光厅', 45618, 30, 0),
(52, '12号激光厅', 45618, 96, 0),
(53, '9号激光厅', 45618, 30, 0),
(54, '1号激光厅', 4670, 33, 0),
(55, '2号激光厅', 4670, 89, 0),
(56, '8 号厅-高清激光', 4670, 28, 0),
(57, '9号厅-高清激光', 4670, 98, 0),
(58, '3楼3号激光厅', 4688, 42, 0),
(59, '4楼7号厅', 4688, 40, 0),
(60, '4楼8号激光厅', 4688, 61, 0),
(61, '4楼DMAX激光巨幕厅', 4688, 91, 0),
(62, '5楼11号厅(取票机在3楼)', 4688, 27, 0),
(63, '1号巨幕厅－7楼', 49616, 82, 0),
(64, '3号巨幕厅－7楼', 49616, 67, 0),
(65, '4号厅－7楼', 49616, 87, 0),
(66, '6号厅－7楼', 49616, 81, 0),
(67, '杜比影院-儿童均需购票', 49616, 53, 0),
(68, '2号CINITY4K&middot;AM', 5018, 73, 0),
(69, '4号厅 Dolby杜比激光厅', 53763, 66, 0),
(70, '5号厅 Dolby杜比激光厅', 53763, 89, 0),
(71, '6号厅 Dolby杜比激光厅', 53763, 85, 0),
(72, '7号厅 Dolby杜比激光厅', 53763, 70, 0),
(73, '8号厅 Dolby杜比激光厅', 53763, 36, 0),
(74, '9号厅 Dolby杜比激光厅', 53763, 98, 0),
(75, '1号激光厅', 54860, 59, 0),
(76, '3号杜比激光厅', 55490, 58, 0),
(77, '1号-激光巨幕影厅', 55622, 55, 0),
(78, '2号-激光巨幕 影厅', 55622, 32, 0),
(79, '3号厅', 55622, 29, 0),
(80, '4号-激光厅', 55622, 93, 0),
(81, '3号厅', 55965, 69, 0),
(82, '1厅停车免3小时', 56072, 38, 0),
(83, '2厅停车免3小时', 56072, 24, 0),
(84, '3厅停车免3小时', 56072, 20, 0),
(85, '4厅 停车免3小时', 56072, 64, 0),
(86, '3号THX中国巨幕厅', 57220, 54, 0),
(87, '4号激光厅', 57220, 91, 0),
(88, '5号全景声激光厅', 57220, 71, 0),
(89, '7号按摩VIP厅', 57220, 37, 0),
(90, '1号厅', 57819, 31, 0),
(91, '4号杜比全景声厅', 57819, 38, 0),
(92, '6号VIP厅', 57819, 24, 0),
(93, 'IMAX厅', 57819, 50, 0),
(94, '3号QMAX杜比全景声厅', 57983, 28, 0),
(95, '5号RGB激光厅', 57983, 34, 0),
(96, '6号RGB激光厅', 57983, 95, 0),
(97, '7号RGB激光厅', 57983, 31, 0),
(98, 'GOLD CLASS厅(儿童需购票)', 58368, 98, 0),
(99, '三维影院', 5864, 62, 0),
(100, '4号激光厅（免费停车3小时）', 58708, 93, 0),
(101, '5号激光厅（免费停车3小时）', 58708, 56, 0),
(102, '1号厅', 59194, 96, 0),
(103, '2号厅', 59194, 62, 0),
(104, 'IMAX激光厅', 59194, 29, 0),
(105, 'VIP厅', 59194, 79, 0),
(106, '杜比全景声厅', 59194, 66, 0),
(107, '2号激光厅4K', 60082, 20, 0),
(108, '4号激光厅4K', 60082, 50, 0),
(109, '7号激光厅4K', 60082, 75, 0),
(110, '1号激光4K厅（影厅）', 61584, 61, 0),
(111, '2号激光4K厅（影厅）', 61584, 58, 0),
(112, '3号巨幕厅', 61829, 55, 0),
(113, '1号激光厅', 61841, 55, 0),
(114, '2号厅Cinity 120帧', 61841, 39, 0),
(115, '3号激光厅', 61841, 99, 0),
(116, '6号激光厅', 61841, 35, 0),
(117, '3号全景声厅 禁止饮食', 61869, 38, 0),
(118, '4号厅 禁止饮食', 61869, 88, 0),
(119, '2号厅（杜比激光4K真皮沙发厅）', 62026, 26, 0),
(120, '4号厅（杜比激光4K4D动感厅）', 62026, 32, 0),
(121, '8号厅（有凌晨场）', 62026, 77, 0),
(122, '9号厅（有凌晨场）', 62026, 52, 0),
(123, '3号PRIME巨幕厅', 62103, 35, 0),
(124, '6号厅', 62103, 89, 0),
(125, '1号全景声（免费停车3小时）禁止饮食', 6244, 49, 0),
(126, '3号激光影厅（免费停车3小时）禁止饮食', 6244, 70, 0),
(127, '4号激光影厅（免费停车3小时）禁止饮食', 6244, 25, 0),
(128, '6号VIP厅（免费停车3小时）禁止饮食', 6244, 68, 0),
(129, '3号超清激光4K厅（新放映设备）', 63391, 87, 0),
(130, '4号超清激光4K厅（新放映设备）', 63391, 49, 0),
(131, '5号超清全景声激光-超好音效', 63391, 83, 0),
(132, '1号厅（4K激光按摩垫厅）', 64687, 65, 0),
(133, '2号厅（4K激光按摩垫厅）', 64687, 79, 0),
(134, '3号厅（4K激光按摩垫厅 ）', 64687, 92, 0),
(135, '2号杜比全景声巨幕厅', 64966, 58, 0),
(136, '4号杜比全景声激光厅', 64966, 40, 0),
(137, '5号杜比全景声激光厅', 64966, 41, 0),
(138, '1号杜比巨幕厅', 64988, 92, 0),
(139, '2号RealD终极巨幕厅', 64988, 44, 0),
(140, '3号沙发激光厅', 64988, 45, 0),
(141, '1号厅', 65004, 80, 0),
(142, '2号厅', 65004, 78, 0),
(143, '3号厅', 65004, 84, 0),
(144, '2号厅-杜比全景声激光巨幕厅-购票送78', 68956, 56, 0),
(145, '1号杜比全景声厅（免 费停车3小时）', 70032, 64, 0),
(146, '2号中国巨幕厅（免费停车3小时）', 70032, 27, 0),
(147, '7号厅（免费3小时停车）', 70032, 91, 0),
(148, '9号 CINITY巨幕厅（高帧率）', 70032, 80, 0),
(149, '1号VIP激光厅（免费停 车3小时）', 8054, 28, 0),
(150, '7号DTS激光厅（免费停车3小时）', 8054, 41, 0),
(151, '8号杜比全景声激光厅（免费停车3小时）', 8054, 39, 0),
(152, 'IMAX厅（免费停车3小时）', 8054, 80, 0),
(153, '3号杜比全景声激光厅 禁止饮食', 8062, 89, 0),
(154, '4号激光厅 禁止饮食', 8062, 51, 0),
(155, '5号激光厅 禁止饮食', 8062, 73, 0),
(156, '2号金逸厅', 8066, 76, 0),
(157, '3号厅(激光影厅) 禁止饮食', 8066, 92, 0),
(158, '4号厅(激光影厅) 禁止饮食', 8066, 54, 0),
(159, '三楼3号激光高清巨幕厅', 9564, 75, 0),
(160, '三楼4号激光厅', 9564, 56, 0),
(161, '三楼5号激光厅', 9564, 44, 0),
(162, '10号厅', 9755, 26, 0),
(163, '3号厅', 9755, 28, 0),
(164, '8号厅', 9755, 92, 0),
(165, 'IMAX厅', 9755, 40, 0),
(166, 'VIP 1', 9755, 54, 0),
(167, '5号杜比全景声厅', 9828, 23, 0),
(168, '6号CINITY 4K杜比全景声厅', 9828, 97, 0);

-- --------------------------------------------------------

--
-- 表的结构 `play`
--

CREATE TABLE `play` (
  `pid` int(11) NOT NULL,
  `cid` int(11) NOT NULL,
  `fid` int(11) NOT NULL,
  `arrangeDate` datetime NOT NULL,
  `startTime` datetime NOT NULL,
  `endTime` datetime NOT NULL,
  `hid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `ticket`
--

CREATE TABLE `ticket` (
  `tid` int(11) NOT NULL,
  `fid` int(11) NOT NULL,
  `cid` int(11) NOT NULL,
  `hid` int(11) NOT NULL,
  `startTime` datetime NOT NULL,
  `pid` int(11) NOT NULL,
  `seatid` int(11) NOT NULL,
  `userName` varchar(20) NOT NULL,
  `state` int(11) NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转储表的索引
--

--
-- 表的索引 `account`
--
ALTER TABLE `account`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `userName` (`userName`);

--
-- 表的索引 `cinema`
--
ALTER TABLE `cinema`
  ADD PRIMARY KEY (`cid`);

--
-- 表的索引 `film`
--
ALTER TABLE `film`
  ADD PRIMARY KEY (`fid`);

--
-- 表的索引 `hall`
--
ALTER TABLE `hall`
  ADD PRIMARY KEY (`hid`);

--
-- 表的索引 `play`
--
ALTER TABLE `play`
  ADD PRIMARY KEY (`pid`);

--
-- 表的索引 `ticket`
--
ALTER TABLE `ticket`
  ADD PRIMARY KEY (`tid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `account`
--
ALTER TABLE `account`
  MODIFY `id` int(15) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 使用表AUTO_INCREMENT `cinema`
--
ALTER TABLE `cinema`
  MODIFY `cid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=70033;

--
-- 使用表AUTO_INCREMENT `film`
--
ALTER TABLE `film`
  MODIFY `fid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1425334;

--
-- 使用表AUTO_INCREMENT `hall`
--
ALTER TABLE `hall`
  MODIFY `hid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=169;

--
-- 使用表AUTO_INCREMENT `play`
--
ALTER TABLE `play`
  MODIFY `pid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `ticket`
--
ALTER TABLE `ticket`
  MODIFY `tid` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
